#if 0
#include <iostream>
using namespace std;
int main(int argc, char *argv[])
{
	/*定义二维数组的方式*/
	//第一种：------------------------------------------------------------------------------------------
	int arr[2][3];//定义一个2行三列的二维数组
	arr[0][0] = 1;
	arr[0][1] = 2;
	arr[0][2] = 3;
	arr[1][0] = 4;
	arr[1][1] = 5;
	arr[1][2] = 6;
	
	for (int i = 0; i < 2; i++)
	{
		for (int j = 0; j < 3; j++)
		{
			cout << arr[i][j] << endl;
		}
	
	}

	//第二种：-------------------------------------------------------------------------------------------
	int arr2[2][3] = {
		{7,8,9},
		{10, 11, 12} 
	};
	for (int i = 0; i < 2; i++)
	{
		for (int j = 0; j < 3; j++)
		{
			cout << arr2[i][j] << endl;
		}

	}
	//第三种：---------------------------------------------------------------------------------------------
	int arr3[2][3] = {13, 14, 15, 16, 17, 18};
	for (int i = 0; i < 2; i++)
	{
		for (int j = 0; j < 3; j++)
		{
			cout << arr3[i][j] << endl;
		}

	}
	//第四种：
	int arr4[][3] = { 19, 20, 21, 22, 23, 24 };//编译器可以根据3列，推算出多少行，不能根据行计算哦
	for (int i = 0; i < 2; i++)
	{
		for (int j = 0; j < 3; j++)
		{
			cout << arr4[i][j] << endl;
		}

	}
	cin.get();
	return 0;
}



#endif // 0
